app/controllers/notify_sending_email_controller.rb

  def send_email

    users = User.all
---
SELECT "users".* FROM "users"