app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = '' LIMIT 1
SELECT "ip_addresses".* FROM "ip_addresses" WHERE "ip_addresses"."address" = '192.168.0.20' LIMIT 1
INSERT INTO "ip_addresses" ("address", "count", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["address", nil], ["count", 0], ["created_at", Wed, 31 Dec 2014 02:42:46 UTC +00:00], ["updated_at", Wed, 31 Dec 2014 02:42:46 UTC +00:00]]
UPDATE "ip_addresses" SET "count" = 1, "updated_at" = '2014-12-31 02:42:46.949958' WHERE "ip_addresses"."id" = 1
---
    def create
        # Get user to see if they have already signed up
        email = params[:user][:email]
        if !email.nil?
            email = email.downcase.strip
        end
        @user = User.find_by_email(email);

        # If user doesnt exist, make them, and attach referrer
        if @user.nil?

            #binding.pry
            #cur_ip = IpAddress.find_by_address(request.env['HTTP_X_FORWARDED_FOR'])
            cur_ip = IpAddress.find_by_address(request.remote_ip)


            if !cur_ip
                cur_ip = IpAddress.create(
                    #:address => request.env['HTTP_X_FORWARDED_FOR'],
                    :address => request.remote_ip,
                    :count => 0
                )
            end

            if cur_ip.count > 2
                return redirect_to root_path
            else
                cur_ip.count = cur_ip.count + 1
                cur_ip.save

SELECT "users".* FROM "users" WHERE "users"."referral_code" = '6ccfe224f6' LIMIT 1
---
            @user = User.new(:email => params[:user][:email])


            @referred_by = User.find_by_referral_code(cookies[:h_ref])

INSERT INTO "users" ("created_at", "email", "referral_code", "referrer_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
            if !@referred_by.nil?
                @user.referrer = @referred_by
            end
            @user.save

SELECT "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT 1
---
    def refer
        email = cookies[:h_email]

        # @bodyId = 'refer'
        @is_mobile = mobile_device?

        @user = User.find_by_email(email)